
inherit ROOM;
#include <ansi.h>

void create ()
{
  	set ("short", HIR" Ѓљд±Ѓ"NOR);
  	set ("long", @LONG
ќі–– э≤љ£ђµЂЉыЋƒѕ¬Јз‘∆±дї√£ђ≈®ќн±ќƒњ£ђ≤їЉы«∞¬Ј£ђ ««∞£њ «љш£њ «„у£њ «
”“£њƒг≤їљы”ћ‘•х№хо£ђЋƒѕ¬ћљЊњ£ђ≤Ѕ √µф¬Ј±я ѓ±Ѓ…ѕЇсЇсµƒ«аћ¶£ђЇ’»ї¬ґ≥ц√№√№¬й
¬йµƒ эЅ–”ђЌЈ–°њђ£ђƒг«ь…нƒэƒњ£ђѕЄѕЄґЅЅЋ∆рјі£ђ…ѕ й£Ї’эЋщќљќёєжЊЎ≤ї≥…Јљ‘≤£ђ
[37m£и£е£м£р°°£т£х£м£е£у[32mЄш≥цЈз‘∆єж‘т£ђ»зєыƒгЌђ“в„с ЎЋщЅ–єж‘т£ђ д»л£б£з£т£е£е
’э љљш»лЈз‘∆µ«¬љ£ђЈс‘тњ…Ћж ±ЌЋ≥ц£®£с£х£й£ф£©°£
LONG);

 	set("no_magic",1);
	set("no_fight",1);
  	set("exits", ([ /* sizeof() == 1 */
  		"agree" : __DIR__"newbie3",
  		
	]));
  
	set("coor/x",0);
	set("coor/y",0);
	set("coor/z",900);
  	
  	setup();
  
}