inherit ROOM;

void create()
{
	set("short", "Ú¤¸®Ç®×¯");
	set("long", @LONG
ÖĞÔ­ÄÏ¹¬ÊÀ¼Ò£¬¼Ò²ÆÍò¹á£¬²úÒµ²»¿ÉÊ¤Êı£¬ÕâÒ»ÇĞ¶¼ÊÇÄÏ¹¬´óÔÚÆßÊ®ÄêÇ°´´ÏÂ
µÄ£¬È»¶øÇ®²ÆÔÙ¶à¡¢ÊÆÁ¦ÔÙ´ó£¬Ò²Áô²»×¡¹´»êĞ¡¹íµÄ½Å²½£¬Ö»ÊÇÕâÄÏ¹¬´ó²»ÖªÊ¹ÁË
Ğ©Ê²Ã´ÊÖ¶Î£¬»òÊÇ»¨ÁË¶àÉÙÒø×Ó£¬¾¹È»ÔÚÕâÍ÷ËÀ³ÇÀïÒ²¿ªÆğÁËÒ»¼ÒÇ®×¯£¬¶øÕâÇ®×¯
¾¹È»ÓëÖĞÔ­µÄ»¹ÊÇÏàÍ¨µÄ¡£¡£¡£¡£¿É¼ûÒõ¼äÑô¼ä£¬ÓĞÆøÃ»Æø£¬×îÓ²Í¨µÄ»¹ÊÇÆ±×Ó¡£
Ç®×¯ÖĞÑëÓĞÒ»ºìÄ¾¹ñÌ¨£¬°ëÈË¶à¸ß£¬ÉÏÓĞÅÆ£¨£ó£é£ç£î£©Ò»¿é¡£

                [37m¡¾ÄÏ¹¬Ç®×¯Ú¤¸®·ÖĞĞ¡¿
[32m
LONG
	);
	set("no_fight", 1);	
	set("no_meal","ÄãºöÈ»·¢ÏÖ¿ÚÖĞµÄÊ³ÎïÒûË®³ÉÁË¿àÉ¬µÄ×ÇÄà£¬¸Ï¿ìÍÛÍÛµØÍÂÁË³öÀ´¡£\n");
	set("exits", ([
        	"northeast"      : __DIR__"pingan",
	]) );
        set("item_desc", ([
                "sign": @TEXT
ÕâÀïÊÇÇ®×¯£¬Ä¿Ç°ÎÒÃÇÌá¹©µÄ·şÎñÓĞ£º

convert     ¶Ò»»Ç®±Ò
withdraw    ÌáÈ¡´æ¿î
deposit     ´æÈëÇ®±Ò
balance     ²éÑ¯´æ¿îÊı¶î
loan	    ÏòÇ®×¯½èÇ®
transfer    Ö±½Ó×ªÕÊ

TEXT
        ]) );

	set("objects", ([
		__DIR__"npc/bankowner" : 1,

			]) );

	set("coor/x",-40);
	set("coor/y",-80);
	set("coor/z",-190);
	set("no_fight",1);
	setup();
}
