#include <ansi.h>
inherit ROOM;
void create()
{
        set("short", "Æ½°²µÀ");
        set("long", @LONG
ÈËËÀºó£¬ÖÁÑÖÍõµîÈ¥½ÓÊÜ·¢ÅĞ£¬ÅĞ¶¨ºó£¬Ôò½«ÉúÇ°¹¦¹ıÂ¼Èë×ª»Ø²áÖĞ£¬ÈôÊÇ×÷
¶ñ¶à¶ËµÄ£¬ÑºÈëÊ®°Ë²ãµØÓüÊÜ¿à£¬ÈôÊÇ¿É×ªÊÀÍ¶Ì¥µÄ¹í»ê£¬ÔòÍ¾¾­µØÓü£¬×ß¹ıÆ½°²
µÀ£¬µ½ÄÎºÎÇÅÈ¥Í¶Ì¥¡£ÒòÎª´ËµØÊÇÍ¶ÉúµÄÈË±Ø¾­Ö®Â·£¬ËùÒÔÊ®·Ö°²¾²£¬Èç¹ûÉÔÓĞĞú
»©£¬±ã»áÔÙ´ôÉÏÊ®Äê¡£Æ½°²µÀµÄÁ½²àÊÇ[33mÍ÷ËÀ³Ç¡¢ÃÏÆÅÍ¤[32mµÈÈ¥´¦¡£
LONG
        );
        set("exits", ([
		"southwest": __DIR__"nanbank",
		"southeast": __DIR__"hospital",
		"northeast": __DIR__"mengpo",
		"northwest": __DIR__"wangsi",
		"south" : __DIR__"aihe",
        ]) );
	set("coor/x",0);
	set("coor/y",-40);
	set("coor/z",-190);
	set("no_fight",1);
	set("no_meal","ÄãºöÈ»·¢ÏÖ¿ÚÖĞµÄÊ³ÎïÒûË®³ÉÁË¿àÉ¬µÄ×ÇÄà£¬¸Ï¿ìÍÛÍÛµØÍÂÁË³öÀ´¡£\n");
	setup();
        
}
 
