#include <ansi.h>
inherit NPC;

void create()
{
        set_name("¼§±ùÑã", ({ "bingyan" }) );
        set("gender", "ÄÐÐÔ" );
        set("age", 42);
	set("long","
ËûËäÔÚ¿ª»³´óÐ¦£¬µ«Ò»Ë«ÑÛ¾¦ÈÔÈñÀûµÃÈçÍ¬ðºÓ¥¡£ÀÁ¶è¡¢³Ù¶Û¡¢ÓÌÔ¥²»
¾ö£¬ËäÊÇ´ó¶àÊýÈËÍ¨³£ÓÐµÄÃ«²¡£¬µ«ÎÞÂÛÊ²Ã´Ê±ºò£¬ÎÞÂÛÊÇË­£¬Ò²ÐÝÏë
ÔÚËûÕâÕÅÀâ½ÇÍ»³öµÄÁ³ÉÏ£¬ÕÒ³öË¿ºÁÕâÖÖÉñÇéÀ´£¬ËûÕû¸öÈË¾ÍºÃÏñÊÇ¾«
Ã÷ºÍÇ¿ÈñµÄ»¯Éí¡£Ëû¾ÍÊÇ³þÁôÏãµÄËÀµ³£¬ºÜÓÐ·ç¶ÈµÄ¼§±ùÑã¡£\n");
	set("combat_exp", 1000000);
        set("chat_chance", 2);
        set("chat_msg", ({
                "
¼§±ùÑã¿àÐ¦×ÅµÀ£º¡°ÎÒÔÚ[33mÉ³Ä®[32mÀïÕûÕûÁ÷ÀËÁËÎåÄê£¬ÎÒÄÇÎåÄêÊÇÈçºÎ¹ýµÄ£¬
Ö»ÅÂË­Ò²ÏëÏó²»µ½£¬ÓÐÒ»´Î£¬ÎÒ¾¹»îÉúÉú±»ÂñÔÚÉ³¶ÑÏÂ£¬Ö±µ½Á½Ììºó£¬
²Å±»Â·¹ýµÄÂæÍÕ¶Ó¾È³öÈ¥£¬ÄÇ¸ÃËÀµÄÉ³Ä®ËäÈ»¸øÁËÎÒÒ»±²×Ó¶¼»¨²»¹âµÄ
²Æ¸»£¬È´Ò²¸øÁËÎÒÂúÉí·çÊª¡£\n",
        }) );

	set("inquiry",([
		"É³Ä®":"»îÔÚÉ³Ä®ÀïµÄÈË£¬ÔçÒÑ±»¶ÍÁ¶³ÉÌúÒ»°ãµÄ¼áÇ¿£¬¼áÇ¿µÃ
ÄãÁ¬Ïë¶¼Ïë²»µ½£¬¶øÄãµÄÐÄ£¬ÄãµÄ¹ÇÍ·£¬È´ÔçÒÑ±»¾ÆÈâ£¬±»Å®ÈË£¬±»
Ì«Êæ·þµÄÉú»îËùÈí»¯ÁË£¬"YEL"É³Ä®ÀïµÄÉú»î"CYN"£¬ÒÑ²»ÊÇÄãÃÇËùÄÜÊÊÓ¦¡£\n",
		"desert":"»îÔÚÉ³Ä®ÀïµÄÈË£¬ÔçÒÑ±»¶ÍÁ¶³ÉÌúÒ»°ãµÄ¼áÇ¿£¬¼áÇ¿µÃ
ÄãÁ¬Ïë¶¼Ïë²»µ½£¬¶øÄãµÄÐÄ£¬ÄãµÄ¹ÇÍ·£¬È´ÔçÒÑ±»¾ÆÈâ£¬±»Å®ÈË£¬±»
Ì«Êæ·þµÄÉú»îËùÈí»¯ÁË£¬"YEL"É³Ä®ÀïµÄÉú»î"CYN"£¬ÒÑ²»ÊÇÄãÃÇËùÄÜÊÊÓ¦¡£\n",
		"É³Ä®ÀïµÄÉú»î":"É³Ä®ÀïµÄÈË£¬ÎªÁËÉú´æËù×ö³öµÄÊÂ£¬ÄãÃÇ·Çµ«×ö²»³ö£¬
¶øÇÒÏë¶¼²»¸ÒÈ¥ÏëµÄ¡£ËûÃÇÎªÁËÅÂÉíÌåÀïµÄË®ÏûºÄ£¬ÄÜÕûÌì²»Ëµ»°£¬
Ò²²»¶¯£¬ËûÃÇ¶Ç×Ó¶öÊ±£¬ÄÜ½«òáòæµ±×ö»ðÍÈÀ´³Ô£¬ËûÃÇ¿ÊÊ±£¬»áÅ¿ÔÚ
µØÉÏÎÅ³öÉ³ÏÂÃæÒ»ÕÉÉîµØ·½µÄÊªÆø£¬ÎªµÄÖ»ÊÇÈ¥ÎüË±µØÏÂÉ³×ÓÀïµÄË®£¡\n",
	]));
		
	set("attitude", "friendly");
	set("class","baiyun");
	
    	set_skill("unarmed", 150);
    	set_skill("force", 150);
    	set_skill("parry", 150);
    	set_skill("dodge", 150);
    	set_skill("calligraphy", 120);
    	set_skill("chessism", 150);
    	set_skill("feixian-steps", 120);
	set_skill("move",120);
    	map_skill("unarmed", "calligraphy");
    	map_skill("force", "chessism");
    	map_skill("dodge", "feixian-steps");
    	map_skill("move","feixian-steps");

        setup();
        carry_object(__DIR__"obj/jcloth")->wear();

}
