#include <ansi.h>
inherit ROOM;

void create()
{
	set("short", HIB"ÈëÄ§¹Ø"NOR);
	set("long", @LONG

Ô¶É½ÔÚÏ¦ÑôÖĞÓÉ´äÂÌ±äÎªÇà»Ò£¬ÈªË®Á÷µ½ÕâÀï£¬Ò²½¥½¥ÂıÁË¡£·çµÄÆøÏ¢È´
¸ü·Ò·¼£¬ÒòÎªÏÊ»¨¾Í¿ªÔÚÉ½ÆÂÉÏ£¬ÎåÉ«çÍ·×µÄÏÊ»¨¾²ÇÄÇÄµØÓµ±§×ÅÒ»µÀ°¯¿Ú£¬
°²Äş£¬ÏéºÍ¡£ÄãÌ§ÆğÍ·À´£¬×ó±ßµÄÉ½±ÚÉÏÈ´ºÕÈ»ÊÇÈı¸öÑªºìµÄ´ó×Ö£º

[1;31m¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¹Ø¡¡¡¡¡¡¡¡Ä§¡¡¡¡¡¡¡¡Èë[2;37;0m


LONG
        );
	set("exits",([
		"northup" : __DIR__"42",
		"southdown" : "/d/bashan/jadegate",
	]) );

/*	set("objects", ([
	__DIR__"npc/wall" : 1,
					]) );*/

  	set("coor/x",40);
	set("coor/y",10);
	set("coor/z",-20);
	set("outdoors", "potboil");
	setup();
}


/*
¨X[ ¡¡- FengYun -¡¡ ]©¨©¨©¨©¨¨[
©®[dancing_faery@hotmail.com]©À©¤©¤¨[
©®[ ¡¡annie 09.2003¡¡ ]©¨©¨©¨¨a    ©¦
©®[ ÀëÀëÂşÈÇÈıÇïÂ¶£¬ÂöÂöÊ±Äı¾ÅÔÂËª ©¦
¨^¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª-¨a
*/
