inherit ROOM;

void create()
{
	set("short", "·çÔÆµÀ");

	set("long", @LONG
¡°Ò»Èë·çÔÆËêÔÂ´ß¡±£¬Õâ¶ùÊÇÁ¬½Ó[33m³ÁÏãÕò[32mºÍ[33mÄÏº£[32mµÄ·çÔÆµÀ£¬°µºÖÉ«µÄµÀÂ·£¬´Ó
ÕâÀï¿ªÊ¼ÍñÑÑÉìÕ¹£¬´©¹ı´äÂÌµÄÊ÷ÁÖ£¬ÑØ×ÅÕ¿À¶µÄºşË®£¬Ò»Í·ÉìÕ¹ÏòÄÖÊĞ£¬Ò»Í·ÈÆ
¹ıºÚÆáÆáµÄÉ­ÁÖÍ¨ÏòÔ¶·½¡£Ô¶É½ÔÚÒõî¨µÄÌìÉ«ÖĞ¿´À´£¬·Â·ğÔÚÎíÖĞ£¬¸ü¼ÓÃÀÀöÉñÃØ¡£
ÕâÀï¾àÀëÊĞÕò²¢²»Ô¶£¬µ«ÕâÒ»ãüºşË®£¬Ò»´øÂÌÁÖ¡£È´ËÆÒÑ½«ºì³¾¸ô¾øÔÚÉ½Íâ¡£
LONG);

	set("type","road");
	set("exits",([
	        "west":__DIR__"me",
        	"southeast":__DIR__"fydao2",
	]) );
        set("outdoors", "chenxiang");
	set("coor/x",20);
	set("coor/y",-40);
	set("coor/z",0);
	setup();
}
