
inherit ROOM;

void create()
{
	set("short", "Îäµ±É½ÃÅ");
	set("long", @LONG
Ò»×ùÎ¡Î¡µÄÉ½ÃÅ£¬ÉÏÃæÊéĞ´×Å[33m¡ºÎäµ±É½¡»[32m¼¸¸ö²Ô¾¢µÄ´ó×Ö¡£Îäµ±É½ÓÖÃûÌ«ºÍÉ½£¬
·åÆæÂÍĞã£¬½§ÏÕÑÒÎ££¬×Ô¹Å¾Í±»ÓşÎª¡°ÌìÏÂµÚÒ»ÏÉÉ½¡±¡£ÌÆ´úÆğ£¬¼¸ºõÀú´ú»ÊµÛ¶¼
¼«Á¦·öÖ²Îäµ±µÀ½Ì£¬µ½Ã÷³¯£¬Îäµ±É½ÒÔ¡°ÖÎÊÀĞşÔÀ¡±µÄ³ç¸ßµØÎ»³ÉÎªÈ«¹úµÀ½ÌµÄ»î
¶¯ÖĞĞÄ¡£Ô¶Ô¶ÍûÈ¥£¬µ«¼ûÈº·åÍ¦Á¢£¬×¿Á¢ÔÆº£¡£
LONG
	);
	set("exits", ([
		"north" : __DIR__"road1",
                "southup" : __DIR__"road2",
	]));
	set("outdoors", "wudang");
	set("coor/x",0);
	set("coor/y",50);
	set("coor/z",-50);
	setup();
	replace_program(ROOM);
}
