// to.c

// inherit F_CLEAN_UP;
// Don't want this command be cleaned up while typing long string.

int main(object me, string arg)
{
    me->edit( (: call_other, this_object(), ({ "do_to", me, arg }) :) );
	return 1;
}

void do_to(object me, string arg, string str)
{
	seteuid(getuid());
	if(arg) me->force_me(arg + " " + str);
	else me->force_me(str);
}

int help(object me)
{
write(@HELP
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m
[0;1;36m╬╫╩ж╓╕┴ю╕ё╩╜ : 	╓╕┴ю╕ё╩╜ : to <╓╕┴ю>[0m
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m   

┐╔╥╘╥╗┤╬╩ф│Ў╢р╨╨╥╘╔╧╡─╬─╫╓, <╓╕┴ю>═и│г╩╟╩ф│Ў╤╢╧в╡─╓╕┴ю╚ч
say , tell , describe , chat , reply ........╡╚бг
бї└¤ : 
 to say
 ╜с╩°└ы┐к╙├ '.'гм╚б╧√╩ф╚ы╙├ '~q'гм╩╣╙├─┌╜и┴╨▒р╝н╞ў╙├ '~e'бг
 бкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбкбк
 ╢л╖╜╔ё╜╠╜╠╓ў : ░▓─с╧п┬х╠╪╢√
 ╜╠╓ў┤є╖Є╚╦Ї▀╖в┤Ї▓┐▓┐│д : Elon
 ╜╠╓ў╨б└╧╞┼Ї▀├■╙у▓┐▓┐│д : ├╬╥ф╚с
 ┤є╡▄╫╙Ї▀┤Є╗ь▓┐▓┐│д : ╖ч╗Ё╤к╬ш
 .

╩ф│Ў╡╜╙й─╗╔╧╡─╜с╣√╘Є╩╟ :

─у╦╡╡└г║╢л╖╜╔ё╜╠╜╠╓ў : ░▓─с╧п┬х╠╪╢√
╜╠╓ў┤є╖Є╚╦Ї▀╖в┤Ї▓┐▓┐│д : Elon
╜╠╓ў╨б└╧╞┼Ї▀├■╙у▓┐▓┐│д : ├╬╥ф╚с
┤є╡▄╫╙Ї▀┤Є╗ь▓┐▓┐│д : ╖ч╗Ё╤к╬ш

[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m   
HELP
    );
    return 1;
}

