
inherit ROOM;

void create()
{
        set("short", "É½½Å");
        set("long", @LONG
[33mÉ³Ä®[32mµ½ÁËÕâÀïËÆºõÒÑ¾­±»Î÷±ßµÄÉ½¸Ôµ²×¡ÁË¡£ÎŞÂÛ¿ñ·çÔõÃ´´µ£¬´óÄ®Ò²²»ÏòÎ÷
À©Õ¹Ò»²½¡£ÕâÀïËäÈ»Ò²ÊÇ¹âÍºÍºµÄ£¬¿ÉÊÇÒÑ¾­²»ÔÙÓĞ×ÆÈËµÄ¿áÈÈ¡£¼¸Öê±»·ç¹ÎÀ´µÄ
¹ö²İÒÑ¾­ÔÚÕâÀïÔúÏÂ¸ùÀ´¡£·­¹ıÕâ×ùÉ½¾ÍÊÇ[33mÈûÍâ[32mÈË¾Ó×¡µÄµØ·½¡£Î÷±±·½ÏòÔòÊÇÌõ²»
¼û¾¡Í·µÄÉ³µÀÍ¨Ïò[33mĞÂ½®[32m£¬¾İËµË¿³ñÖ®Â·¾ÍÊÇ´ÓÕâ¶ù¿ªÊ¼µÄ¡£¡£¡£
LONG
        );
        set("exits", ([ 
  "east" : __DIR__"desert10",
  "northwest" : __DIR__"skyroad1",
  "west" : __DIR__"mroad",
]));
        set("outdoors", "quicksand");

	set("coor/x",-1110);
	set("coor/y",-10);
	set("coor/z",0);
	setup();
        replace_program(ROOM);
}

