inherit ROOM;

void create()
{
        set("short", "É³Áë");
        set("long", @LONG
·ÅÑÛÍûÈ¥£¬Ö»ÓĞ»ÆÉ³£¬ÎŞ±ßÎŞ¼Ê£¬ÎŞÇîÎŞ¾¡µÄ»ÆÉ³£¬Ã»ÓĞË®£¬Ã»ÓĞÉúÃü£¬Ò²
Ã»ÓĞÏ£Íû¡£´Ë´¦µØÔ¶ÈËÏ¡£¬Ê±³£³öÃ»µÄÉ³µÁºáĞĞ²şâ±£¬É³ÇğÉÏºÕÈ»Ê¬Éí×İºá£¬Ñª
¼£Î´¸É¡£¸üÎª¿É²ÀµÄÊÇÆµ·±µÄÉ³±©£¬µ«¼û»ÆÉ³ÔÚ·ç±©ÖĞ¾íÎè£¬Î¨ÓĞÑØ×ÅÁë¼¹Íù[33m±±[32m
²ÅÓĞ³öÂ·£¬ÈôÊÇºúÂÒÏ¹´³£¬ÕâÒ»±²×ÓÒ²²»Ò»¶¨×ßµÃ³öÈ¥¡£
LONG
        );
        set("exits", ([ 
		"south" : 	__DIR__"greenland",
		"west" : 	__DIR__"desert6",
		"northeast" : 	__DIR__"mirage",
		"east" : 	__DIR__"desert8",
	]));
        set("outdoors", "loulan");
	set("coor/x",-1085);
	set("coor/y",50);
	set("coor/z",0);
	setup();
}
