// annie 07.2003
// dancing_faery@hotmail.com

#include <ansi.h>
inherit ROOM;
string look_stone();

void create()
{

	set("short", HIB"¼ÀÌìËşÍâ"NOR);
    set("long", @LONG
É½¹ÈÉî´¦ÊÇÒ»×ùÍ¨ÌåÓÉÎÚÄ¾½¨ÖşµÄ¸ßËşÒÙÁ¢ÔÚÂúÉ½µÄÇà±ÌÖ®ÖĞ£¬Àú¾­·ç´µ
ÓêÁÜÈ´ÒÀÈ»ÍêÕû£¬Ë¿ºÁ¿´²»³öËêÔÂÊ´¿ÌµÄºÛ¼£¡£ËşÃÅÍâ·Å×ÅÁ½¸ö»îÎïÒ»°ãµÄÊ¯
Ê¨×Ó£¬Õı¾¼¾¼ÓĞÉñµØµÉ×ÅÄã£»Ì§Í·ÑöÍû£¬Ö»¼ûØÒ¶îÉÏÁú·É·ïÎèµÄÊÇËÄ¸ö½ğÉ«Ñô
¿Ì´ó×Ö£º
¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡[45m[1;33m¨X¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¨[[2;37;0m
¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡[45m[1;33m¨O¡¡¼À¡¡¡¡ÒÔ¡¡¡¡Ìì¡¡¡¡²Ô¡¡¨O[2;37;0m
¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡[45m[1;33m¨^¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¨a[2;37;0m¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡

LONG
NOR
        );
	set("objects", ([

	__DIR__"npc/lion":2,
	__DIR__"npc/ye":1,

	]));
	set("no_fly",1);
	set("item_desc", ([

	"west":"É½ÒõÖĞ´¦´¦ÓĞÎí£¬ÄãÊ²Ã´Ò²·Ö±æ²»Çå³ş¡£\n",
	"east":"É½ÒõÖĞ´¦´¦ÓĞÎí£¬ÄãÊ²Ã´Ò²·Ö±æ²»Çå³ş¡£\n",
	"north":"É½ÒõÖĞ´¦´¦ÓĞÎí£¬ÄãÊ²Ã´Ò²·Ö±æ²»Çå³ş¡£\n",
	"south":"É½ÒõÖĞ´¦´¦ÓĞÎí£¬ÄãÊ²Ã´Ò²·Ö±æ²»Çå³ş¡£\n",

	]) );
	set("exits",([
  		"south" : __DIR__"bottom16",
		"enter" : __DIR__"maze/entry",
	]) );

	set("coor/x",-10);
	set("coor/y",40);
	set("coor/z",-100);
	setup();
}

/*
int	valid_leave(object who, string dir)
{
	if (dir != "enter")
		return ::valid_leave(who,dir);

	if (!present("Ê¯Ê¨×Ó",this_object()))
		return ::valid_leave(who,dir);
	write("èòèòÈçÉúµÄÊ¯Ê¨Ò»Ë«Ô²ÑÛÕıµÉ×ÅÄã£¬ÆøÊÆÆÈµÃÄãÍ£×¡½Å²½¡£\n");
	return notify_fail("");
}*/

/*

¡¡¡¡¡¡¡¡¡¡¡¡¡¡¨X¨Y
¡¡¡¡¡¡¡¡¡¡¡¡¡¡¨U¨t¨r
¡¡¡¡¡¡¡¡¡¡¡¡¡¡¨U©¦¨t¨r
¡¡¡¡¡¡¡¡¡¡¡¡¡¡¨U©¦©¦¨t¨r
¡¡¡¡¡¡¡¡¡¡¡¡¡¡¨U©¦©¦©¦©¦
¡¡¡¡¡¡¡¡¡¡¡¡¡¡¨^¨k¨k¨k¨_

¡¡¡¡¡¡¡¡¡¡¡¡¡¡- FengYun - ¡¡¡¡¡¡
¡¡¡¡¡¡¡¡¡¡¡¡annie 08.2003
¡¡¡¡¡¡dancing_faery@hotmail.com
*/


