#include <room.h>
#include <ansi.h>
inherit ROOM;

void create()
{
    set("short", HIR"·ïÇó»Ë¿ÍÕ»"NOR);
    set("long", @LONG
Ç°Ìü¹Ò×ÅÒ»·ùÁú·ïË«·ÉµÄ¾Ş»­¡£µ±ÃÅ¹Ò×Å¶ÔÔ§ÑìÇò£¬ÇòÉÏÏµ×Å¼¸¸öĞ¡Ğ¡µÄ»ÆÍ­
·çÁå¡£Î¢·çÂÓ¹ı£¬·çÁå·¢³öÇå´àÔÃ¶úµÄ¶£ßËÉù¡£Ò»¸öÂúÃæ´º·çµÄĞ¡¶şÕıÃ¦ÂµµØ[37mÕĞ´ı[32m
¹Ë¿Í£¬°¸×ÀÉÏÌù×ÅÕÅ[37m°×Ö½[32m£¬ÉÏÃæÁú·É·ïÎèµØĞ´×Å¼¸¸ö²İ×Ö¡£×ß³ö´óÃÅ£¬Ó­Ãæ±ãÊÇ¶·
´óµÄ´óºì[37mµÆÁı[32m£¬µÆÁıÏÂÒ»¿Ú[37m´ó¸×[32m£¬ÏëÊÇÎªÍùÀ´ĞĞÈËÌá¹©ÇåË®¡£
LONG);
    set("exits", ([ /* sizeof() == 4 */
	"west" : __DIR__"huanyun4",
      ]));
    set("valid_startroom", 1);
    set("resource/water", 1);
    set("liquid/container", "Ë®¸×");    
    set("item_desc", ([
	"´ó¸×":	"Ò»¿Ú´ó¸×£¬Ë®Çå¼ûµ×£¬Èç¹ûÄãÓĞË®´ü»òÕßºùÂ«£¬¿ÉÒÔÔÚÕâ¶ù´òË®£¨fill ÈİÆ÷£©
Èç¹ûÄã¸ÕÀ´£¬¿ÉÒÔÊÔ×ÅÓÃ fill hulu
¶øºó¾Í¿ÉÒÔºÈÁË£¬drink hulu\n",
	"°×Ö½":	"Ğ¡µêÉúÒâ·±Ã¦£¬ÓûÎÊÂ·Çë×Ô¼º¿´µØÍ¼£¨Ê¹ÓÃmapÖ¸Áî£©\n",
	"µÆÁı": HIR" 			ÓĞ ·ï Çó »Ë 
\n\n"NOR,
	"ÕĞ´ı": "±¾µê¹©Ó¦ÉÏºÃ¾Æ²Ë£¬ÇëÊ¹ÓÃlistÖ¸Áî¡£
Èç¹ûĞèÒª¹ºÂò£¬Ê¹ÓÃbuy Ä³Îï from Ä³ÈË
¶øºó¾Í¿ÉÒÔ³ÔÁË£¬eat Ê³ÎïÃû\n",
      ]));

    set("objects", ([
	__DIR__"npc/waiter" : 1,
      ]) );

    set("coor/x",80);
    set("coor/y",-200);
    set("coor/z",0);
    set("no_dazuo",1);
    set("map","fysouth");
    setup();
    //        replace_program(NEWBIE_HELP_ROOM);
}



