inherit ROOM;
#include <ansi.h>

void create()
{
    set("short", HIR"╝└╜г═д"NOR);
    set("long", @LONG
╝└╜г╩╟├┐╕Ў╧░╬ф╓о╚╦▒╪╫Ў╓о╩┬бг├┐╖ъ╥╗─ъ╥╗╢╚╡─╖ч╘╞│╟▒╚╬ф┤є╚№гм╖▓╩╟▓╬╚№╡─
╚╦╢╝╗с╡╜╒т╢∙└┤╝└╥╗┤╬▒°╚╨гм╥╘╟є║├╘╦бг═д╫╙╝ф▓╗┤єгм╦─├ц═и╖чгм╥╗╡└│д│д╡──╛╣ё
░╤╖┐╝ф╕Ї│╔┴╦┴╜▓┐╖╓гм└я├ц╩п░х╡╪╒¤╡▒╓╨╩╟╥╗╕Ў╥▒╜г┬пгм═и║ь╡─┬п╗Ё░╤═д─┌╥╗╟╨╢╝
╚╛╔╧╥╗▓у║ь╔лбг├┼┐┌╙╨╥╗┐щ┤є╩п▒огигєгщгчгюгйбг
LONG
    );
    set("exits", ([ /* sizeof() == 4 */
	"west" : __DIR__"huanyun8",
      ]));
    set("objects", ([
	__DIR__"npc/wangfuren" : 1,
      ]) );
    set("item_desc", ([
	"sign": @TEXT	
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m
[0;1;36m			╝└╜г═д╥╡╬ё[0m
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m

─у╘┌╒┼╠·╜│─╟└я┤Є═ъ╫╘╓╞╬ф╞ў║єгм╛═┐╔╥╘└┤╒т└я╝└╜ггм╥╘╠с╕▀╬ф╞ў╡─
╔╦║ж┴жгм╝└╜г╡─╓╕┴ю║▄╝Є╡ег║	ji  ╬ф╞ў├√
▓╗╣¤гм╧ы╥к╙╨╥╗░╤║├╬ф╞ўгм▓╗╜Ў╤№░№╥к╣─гм╗╣╥к─▄╒╥╡╜║├╡─╕и╓·┐є┴╧бг

[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m
TEXT
      ]) );

    set("coor/x",80);
    set("coor/y",-240);
    set("coor/z",0);
    set("map","fysouth");
    setup();
    replace_program(ROOM);

}
