inherit ROOM;
void create()
{
    set("short", "Ё╓юж╥╩");
    set("long", @LONG
уБюО╠╬йгр╩ф╥гу╡НрС╢Схктз╥ГтфЁг╣дяццекЫтзё╛втрС╢Схкрей╖ак╣╠╫Яй╔ио╣дип
╥╫╠╕╫ёё╛╠╩╩йиор╩е╜ж╝об╠Ажа╪цдон╙╧ы╨Сё╛╬иху╥Г╧Бнчоч╣дяцце╠ЦцелЭюДбДё╛фф╟э
╡╩©╟║ё╨Сю╢р╩цШппвъ╫╜╨Ч╣дбДфг©мх╢ф╚ф╚╪ПакуБюО╟з©╙╣юЁ║ё╛мФфПак╫╜╨Ч╟яо╥ё╛╡╩
╧Щеёф╓╣╧уФ╡╩йг╢╣╣дё╛жа╫Ян╙ж╧нчхкдэ╡П╢╘уБф╜вс╣дп║╟яо╥║ёуБф╜вср╡╢сжпюлак╡╩
иыё╛╦Элц╤Ь╩йж╝╣дтзяцце╬иж╥╫╗фПакуБ╪рЁ╓юж╥╩║ё╤╚цФ╣дг╫╠зио╦ъ╦ъ╧ракр╩╦Жефвс
ё╗ёСёИёГёНё╘ё╛иоцФп╢весно╥╣дмФ╥╗║ё
LONG
    );
    set("exits", ([ /* sizeof() == 4 */
	"north" : __DIR__"ecloud2",
      ]));
    set("item_desc", ([
	"sign": @TEXT
[0;1;37m╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓[0m
[0;1;31m		к╣нрппё╛нр╬мппё╛╡╩╥Ч╡╩пп[0m
[0;1;37m╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓[0m

уБюОйгЁ╓юж╥╩ё╛ртобйгсно╥╣дмФ╥╗ё╨

р╙мФ╠╬сно╥дЦиМио╠ьпКр╙спрЬвс╡епп
play    ©╙й╪мФсно╥
show    ╡И©╢в╢л╛
resign  хойД
take    дцй╞вс
╠ххГё╨ take 5 3 ╠Мй╬╢с╣знЕппдцхЩ╦Жй╞вс
╧ФтР╨э╪Р╣╔ё╛╢С╪рбжаВдцй╞всё╛к╜охдц╣╫вН╨Ср╩╦Жк╜╬мс╝ак║ё

[0;1;37m╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓╘╓[0m

TEXT
      ]) );
    set("objects", ([
	__DIR__"npc/pianzi": 1,
      ]) );

    set("indoors", "fengyun");
    set("coor/x",120);
    set("coor/y",-20);
    set("coor/z",0);
    setup();

}
