// marry_room.c
#include <ansi.h>
// tie@fengyun
#include <room.h>
inherit ROOM;

void create()
{
    set("short", HIM"╘з╤ь═д"NOR);
    set("long", @LONG
─у╧╓╘┌╒¤╒╛╘┌╘з╤ь═д└ягм╒т└я╩╟╫и├┼╠ц╚╦╡▐╜с╗щ╘╝║═╜т│¤╗щ╘╝╡─╡╪╖╜гм│╟└я╦∙
╙╨╡─╖Є╕╛╢╝╩╟╘┌╒т└я╧▓╜с┴╝╘╡╡─гм╛═┴м╕╜╜№╒Є╫╙╥▓╙╨╨э╢р─╜├√╢°└┤╡──ъ╟р╚╦го┐┐╜№
├┼┐┌╡─╡╪╖╜╙╨╥╗┐щ╬┌─╛╡ё│╔╡─╒╨┼╞гигєгщгчгюгйбг
LONG
    );
    set("exits", ([
	"east"          : __DIR__"huanyun4", 
      ]) );

    set("item_desc", ([
"sign": @TEXT
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m
[0;1;36m		╘з╤ь═д╠с╣й╥╡╬ё[0m
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m


гк╡▐╜с╗щ╥ЎгигэгсгЄгЄг∙гйг║╥к╟є─╨г▒г┤бв┼ог▒г▓╥╘╔╧

гк╜т│¤╗щ╘╝г║╙╨┴╜╓╓═╛╛╢
гиг▒гй└ы╗щгигфгщгЎгягЄгугхгй╥к╟є╦л╖╜╘┌│б╫╘╘╕
гиг▓гй╥┼╞·гигфгхгєгхгЄгЇгхгфгй
╡▒╥╗╖╜═╦│Ў╖ч╘╞ги╚ч╫╘╔▒бв╟х╡╡╡╚гй╗Є│д╞┌▓╗╘┌╧▀гиг╢г░╠ь╥╘╔╧гйгм
╘Є┴э╥╗╖╜┐╔╡е╖╜├ц╥╘▒╗╥┼╞·╠с│Ў╜т│¤╗щ╘╝бг


[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m
TEXT
      ]) );
      
    set("objects", ([
	__DIR__"npc/mei_po" : 1,
      ]) );

    set("coor/x",40);
    set("coor/y",-200);
    set("coor/z",0);
    set("map","fysouth");
    setup();

}
