inherit ROOM;
void create()
{
    set("short", "├▐╗и╖╗");
    set("long", @LONG
├┐╡▒╠ь╞°╜е└фгм╖ч╘╞└╧╔┘╢╝╗с╡╜╒т╢∙└┤╜л╫╘╝║╡─╢м╔└гм╢м▒╗╡п╥╗╡пгм╒т└я╡─└╧
░х─я╕№╔├│д▓╣╥┬╖■гм▓╣│Ў└┤╡─╥┬╖■▓╗╡л└╬╣╠гм╢°╟╥╫▄╩╟╟б╡╜║├┤ж╡╪╨х╢ф╗игм┤Є╕Ўё▐
╢∙╩▓├┤╡─гм╥╗╡у╢∙╥▓┐┤▓╗│Ў▓╣╣¤╡─║█╝гбг╟╜╔╧╠∙╫┼╥╗╒┼╩╒╖╤╕ц╩╛гиsignгйбг
LONG
    );
    set("exits", ([ /* sizeof() == 4 */
	"west" : __DIR__"huanyun5",
      ]));
    set("objects", ([
	__DIR__"npc/mianhua" : 1,
      ]) );
    set("item_desc", ([
	"sign": @TEXT
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m
[0;1;36m		├▐╗и╖╗╩╒╖╤гм└╧╔┘╬▐╞█[0m
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m

╨▐▓╣╥┬╬ягигтгїгйг║ ├┐╡у╥╗┴╜╗╞╜Ёбг

[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m
TEXT
      ]) );
    set("coor/x",80);
    set("coor/y",-160);
    set("coor/z",0);
    set("map","fysouth");
    setup();
    replace_program(ROOM);
}

/*
ги1гй╨▐▓╣╥┬╬ягигтгїгйг║
* ╫╘╓╞╥┬╬я├┐╡у╢■┴╜╗╞╜Ёго
* ╖└╗д┴ж20╥╘╧┬═│╩╒╥╗┴╜╗╞╜Ёгм20╥╘╔╧├┐╡у╬х┴╜╗╞╜Ёбг

ги2гй╝╙╓п╫╘╓╞╥┬╬ягиг·гшгщгйг║╝█╕ё├ц╥щ

*/