inherit ROOM;
void create()
{
    set("short", "ÉñÅ©¾Ó");
    set("long", @LONG
ÉñÅ©³¢°Ù²İ£¬Ê¼ÓĞÒ½Ò©¡£°ÙÀïÁã±¾Îª¾©³ÇÖĞ¹Ù»ÂÖ®¼Ò×ÓµÜ£¬½õÒÂÓñÊ³£¬µ«ÌìÓĞ
²»²â·çÔÆ£¬Ä³ÈÕ³¯ÖĞÉú±ä£¬Öï°ÙÀïÒ»×å£¬°ÙÀïÁãĞÒÔÚËÄ´¦ÓÎÍæÎ´¹é£¬¶ã¹ıÒ»½Ù£¬ÓÚ
ÊËÍ¾ºÁÎŞĞËÈ¤£¬ÒòÆäÒ»ÏòÑöÄ½¹ÅÊ±ÉñÅ©£¬ÓÖ¸ĞÆäÊ±ÖÚÈË¶àÊÜ¼²²¡Ö®¿à£¬Òò´Ë±é·ÃÃû
´¨´óÔó£¬Àú¾¡Çî¿àÖ®µØ£¬³¢°Ù²İ£¬ÖøÒ½Êõ£¬¾ÈÖÎÖÚÉú¡£ÌÃÖĞĞüØÒÒ»¿é£º [33m

        		    ºŞ²»ÄÜ³¢ÌìÏÂ²İ
                            Ì¾ÎŞ¼¼¾ÈÊÀ¼äÈË
[32m
LONG
    );

    set("exits", ([
	"west"    	: __DIR__"swind5",
      ]) );
    set("objects", ([
	__DIR__"npc/baili" : 1,

      ]) );
    set("coor/x",20);
    set("coor/y",-240);
    set("coor/z",0);
    set("map","fysouth");
    setup();
    replace_program(ROOM);

}
