#include <ansi.h>

inherit ROOM;

void create()
{
    set("short", "ÀΩ€”—ßÃ√");
    set("long", @LONG
’‚¿Ô“‘«∞ «“ªº“œ¥“¬µÍ£¨ «”–«Æ»ÀΩ´“¬∑˛ƒ√¿¥Ω¨œ¥µƒµÿ∑Ω°£◊‘¥”’‚¿Ôµƒ¿œ∞ÂƒÔ
»• ¿¡À“‘∫Û£¨”–“ª∏ˆ¿œ»À◊°¡ÀΩ¯¿¥£¨∞—À¸∏ƒ≥…“ªº‰ÀΩ€”£¨µ´“ÚŒ™µÿ«¯Ã´¬“£¨≤¢√ª”–
º∏∏ˆ—ß…˙°£√≈ø⁄”–“ª∏ˆ¥Ûƒæ≈∆£®£Û£È£Á£Ó£©°£
LONG
    );
    set("exits", ([ /* sizeof() == 1 */
	"north" : __DIR__"ecloud1",
      ]));

    set("objects", ([
	__DIR__"npc/taipo" : 1,
      ]) );
    set("coor/x",80);
    set("coor/y",-20);
    set("coor/z",0);
    set("map","fyeast");
    setup();

}



void init(){
    add_action("do_look","look");
}


int do_look(string arg){
    string msg;

    if (arg == "sign" || arg == "ƒæ≈∆"){
	msg = "
[0;1;37m©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§[0m
[0;1;31m		ÃÏπ§ø™ŒÔ£¨…ÒπÌƒ™≤‚[0m
[0;1;37m©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§[0m
             
”√ÀΩ€”œ»…˙∏¯µƒÀƒ∏ˆ ˝∫Õ+,-,*,/,º∞()À„≥ˆ∂˛ ÆÀƒ°£

¿˝»Á£∫	»Áπ˚’‚Àƒ∏ˆ ˝ «£∫æ≈,∂˛,»˝,»˝. «Î‘⁄“ª∑÷÷”ƒ⁄∏¯≥ˆ¥∞∏(answer)
	answer (9-2)*3+3
	µ⁄“ª∏ˆ¥∂‘µƒΩ±¿¯“ª∞ŸŒƒ°£
             
";
	//	if (stringp(this_object()->query("question")))
			msg = msg + WHT"		œ÷‘⁄µƒŒ Ã‚ «" + query("question") + "\n"NOR;
		
		msg += "[0;1;37m©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§©§[0m\n";
		write(msg);
		return 1;
	}        	
	return 0;
}
