#include <ansi.h>
inherit F_CLEAN_UP;


int main(object me, string arg)
{

	if (!arg) 
		return notify_fail("┤╦├№┴ю╨ш╥к▓╬╩¤гм╟ы▓╬╝√гшгхгьгЁббгсгцгыбг\n");
		
	if (!me->query("afk_msg"))
		me->set("afk_msg",WHT"╢╘▓╗╞Ёгм╟ы╔╘║є┴к╧╡бг\n"NOR);
	
	if(arg == "on") {
		me->set("env/afk",1);
		tell_object(me,WHT"─у╧╓╘┌╔ш╢и╬к└ы╗·╫┤╠мбг\n"NOR);
		tell_object(me,WHT"─у╡─╫╘╢п┤Ё╕┤╨┼╧в╬кг║"+me->query("afk_msg")+"бг\n"NOR);
		return 1;
	}
	
	if (arg=="off") {
		me->set("env/afk",0);
		tell_object(me,WHT"─у╚б╧√┴╦└ы╗·╫┤╠мбг\n"NOR);
        	return 1;
        }
	
	me->set("afk_msg",arg);
	tell_object(me,WHT"╔ш╢и─у╡─└ы╗·╫╘╢п┤Ё╕┤╨┼╧в╬кг║"+me->query("afk_msg")+"бг\n"NOR);
	return 1;
}


int help(object me)
{
	write(@HELP
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m
[0;1;36m╓╕┴ю╕ё╩╜г║гсгцгы <╤╢╧в>[0m
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m

╒т╕Ў╓╕┴ю╚├─у╔ш╢и╘┌╖в┤Ї╫┤┐Ў╧┬╡─╫╘╢п┤Ё╕┤гм╩╣╙├╖╜╖и╬кг║

гсгцгыббгягюбббб┤Є┐к╫╘╢п┤Ё╕┤бг

гсгцгыббгягцгцбб╣╪▒╒╫╘╢п┤Ё╕┤бг

гсгцгыббг╝╫╘╢и╥х╨┼╧вг╛бббб╢и╥х╫╘╝║╡─╫╘╢п┤Ё╕┤╨┼╧вбг

╛┘└¤г║

╒┼╚¤╔ш╢игсгцгыббгягюгм╡▒└ю╦─гЇгхгьгьббг·гшгсгюгчгєгсгюббр╦гм─у║├бг
╒┼╚¤╫╘╢п┤Ё╕┤└ю╦─г║б░╬╥╚е│╘╖╣┴╦гм╣¤╗с╢∙╘┘┴─бгб▒
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m
HELP
	);
	return 1;
}
