inherit ROOM;

void create()
{
    set("short", "Ã§ÁÖ±ßÔµ");
    set("long", @LONG
ÎŞÒâÖĞµÀÂ·Ô½À´Ô½Õ­£¬Á½ÅÔµÄÊ÷Ö¦Ô½À´Ô½ÃÜ£¬Ê÷·ìÖĞÈ÷ÏÂÀ´µÄÑô¹âÒ²±äµÃ°ß°ß
µãµã¡£Ã©²İ½¥ºñ£¬¹àÄ¾´ÔÉú£¬Â·¾¶ÂşÃğ¡£´µÀ´µÄ·çÒ²Ô½·¢µÄÒõÀä³±Êª¡£Ô¶·½ÃÜÁÖµÄ
Ìì¿ÕÉÏÓĞ¼¸Ö»ÅÌĞıµÄÍºÓ¥£¬·¢³öËºĞÄÁÑ·ÎµÄ½ĞÉù£¬ÁîÈËÃ«¹ÇËÊÈ»¡£Â·±ßÍáÍáÅ¤Å¤Ìù
×ÅÕÅ¸æÊ¾£º[33m¡ºÃÍÊŞ³öÃ»£¬ÓĞÈ¥ÎŞ»Ø¡»[32m
LONG
    );
    set("exits", ([ /* sizeof() == 4 */
	"south" : __DIR__"groupn2",
	"north" : AREA_FYCYCLE"fyroad0",
      ]));
    set("outdoors", "manglin");
    set("NONPC",1);
    set("coor/x",50);
    set("coor/y",-40);
    set("coor/z",20);
    setup();

}
