// rehash.c

inherit F_CLEAN_UP;

int main(object me, string arg)
{
	if( !arg )
		return notify_fail("╓╕┴ю╕ё╩╜г║rehash <┬╖╛╢>\n");

	if( arg[strlen(arg)-1]!='/' ) arg += "/";
	if(  file_size(arg)!=-2 )
		return notify_fail("├╗╙╨╒т╕Ў─┐┬╝гб\n");

	write("╕№╨┬╓╕┴ю▒эг║" + arg + "\n");
	COMMAND_D->rehash(arg);
	return 1;
}

int help(object me)
{
	write(@HELP
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m
[0;1;36m╬╫╩ж╓╕┴ю╕ё╩╜ : 	rehash <─┐┬╝├√│╞>[0m
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m   

╒т╕Ў╓╕┴ю╗с╕№╨┬╧╡═│─┌▓┐╡─╓╕┴ю▒эгм╚ч╣√─у╨┬╘Ў╗Є╔╛│¤┴╦─│╕Ў─┐┬╝╧┬╡─
╓╕┴югм▒╪╨ы╙├╒т╕Ў╓╕┴ю╕№╨┬╕├─┐┬╝▓┼─▄╩╣╙├бг

[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m   
HELP
	);
	return 1;
}
