// emote.c (Mon  09-04-95)

#include <ansi.h>
inherit F_CLEAN_UP;
 
int main(object me, string str)
{
    	if (!str) {
        	write(CYN"─у┐┤╞Ё└┤▒э╟щ╖с╕╗бг\n"NOR);
        	tell_room(environment(me), CYN+(string)me->name()+
			"┐┤╞Ё└┤▒э╟щ╖с╕╗бг\n" +NOR, me);
        	return 1;
    	}
    	write(CYN"─у"+str+"\n"NOR);
    	tell_room(environment(me), CYN+(wizardp(me)? "":"  ")+(string)me->name()+
        str+"\n"+NOR, me);
    	return 1;
}
 
int help(object me)
{
	write(@HELP
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m
[0;1;36m╓╕┴ю╕ё╩╜ : 	emote <╢п╫ў┤╩>[0m
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m   

╒т╕Ў╓╕┴ю┐╔╥╘╚├─у▒э┤я╥╗╕Ў╧╡═│├╗╙╨╘д╔ш╡─╢п╫ў┤╩, ╧╡═│╗с╜л─у╦∙╩ф╚ы
╡─╬─╫╓╝╙╔╧─у╡─╨╒├√сс╧╘╩╛╕°╦∙╙╨╘┌═м╥╗╕Ў╡╪╖╜╡─╔·╬я┐┤. ╬к┴╦▒▄├т╘ь
│╔└з╚┼, ═ц╝╥╦∙╩ф╚ы╡─┤╩╛ф╟░├ц╗с╝╙╔╧ -> ╥╘╣й╟°▒Ё. (╣▄└э╘Є▓╗╘┌┤╦
╧▐.)

бї└¤: emote ╫°┴╦╧┬└┤бг
─у╗с┐┤╝√: ─у╫°┴╦╧┬└┤бг
╞ф╦√╚╦╗с┐┤╡╜: ->░№╫╙╫°┴╦╧┬└┤бг

╞ф╓╨, ░№╫╙╛═╩╟─у╡─├√╫╓.

╧р╣╪╓╕┴ю: semote
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m   
HELP
	);
        return 1;
}
