// wimpy.c

inherit F_CLEAN_UP;

int help(object me);

int main(object me, string arg)
{
        int wmp;

        if( !arg ) {
                write("╡▒─у╧╓╘┌╡─╛л┴жгм╞°╤кгм╗Є╨─╔ё╡═ь╢ " + (int)me->query("env/wimpy") 
                        + "% ╩▒╛═╗с│в╩╘╠╙┼▄бг\n");
                return 1;
        }
        if( sscanf(arg, "%d", wmp)!=1 || wmp < 0 || wmp > 99)
                return help(me);

        me->set("env/wimpy", wmp);
        write("Ok.\n");
        return 1;
}

int help(object me)
{
        write(@HELP
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m
[0;1;36m╓╕┴ю╕ё╩╜ : 	wimpy [<╠╙┼▄╩▒╛л┴жгм╞°╤кгм╗Є╨─╔ё╡─░┘╖╓▒╚>][0m
[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m   

╒т╕Ў╓╕┴ю╚├─у╔ш╢и╡▒╛л┴жгм╞°╤кгм╗Є╨─╔ё╩г╧┬░┘╖╓╓о╢р╔┘╩▒гм╥к┐к╩╝б╕╫к╜°б╣бг

[0;1;37mйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйдйд[0m 
HELP
        );
        return 1;
}

