// Room: /d/oldpine/epath2.c

inherit ROOM;

void create()
{
        set("short", "Ð¡Ê¯ÇÅ");
        set("long", @LONG
ÄãÏÖÔÚÕýÕ¾ÔÚÒ»×ù³¤ÂúÇàÌ¦µÄ¹ÅÇÅÉÏ£¬ÇÅÏÂÊÇÒ»ÌõÉ½½§£¬¼¸¹ÉÇåÈªÔÚÂÒÊ¯Ö®ÖÐ
ÏòÉ½ÏÂ±¼Á÷£¬ÇÅ±±±ß²»Ô¶´¦ÓÐÒ»¸ö[37mÆÙ²¼[32m£¬´ÓÉ½±ÚÉÏÓÌÈçÒ»Ìõ°×Á·°ã´¹ÁËÏÂÀ´£¬ÆÙ²¼
Á½ÅÔµÄÊ¯±ÚÊ®·Ö¶¸ÇÍ£¬¸ß¶ÈºÍÉ½½§ÅÔµÄËÉÁÖÏà²îÁË½üÈý¡¢ËÄÊ®ÕÉ¡£
LONG
        );
        set("item_desc", ([
                "waterfall":
                        "Õâ¸öÆÙ²¼´ÓÊý°ÙÕÉ¸ßµÄÉ½±ÚÉÏ³å¼¤¶øÏÂ£¬Á÷ÈëÒ»¸öÉ½½§µ×µÄÐ¡Ë®Ì¶£¬\n"
                        "Ë®Ì¶Á½±ßµÄÊ¯±Ú´¹ÏÂÐí¶àµÄ[37mÌÙÂû[32m(vine)£¬Äã×¢Òâµ½ÆÙ²¼ááÃæËÆºõ\n"
                        "ÓÐÊ²÷á¶«Î÷ÔÚ·¢Öø¹â¡£\n",
                "ÆÙ²¼":
                        "Õâ¸öÆÙ²¼´ÓÊý°ÙÕÉ¸ßµÄÉ½±ÚÉÏ³å¼¤¶øÏÂ£¬Á÷ÈëÒ»¸öÉ½½§µ×µÄÐ¡Ë®Ì¶£¬\n"
                        "Ë®Ì¶Á½±ßµÄÊ¯±Ú´¹ÏÂÐí¶àµÄ[37mÌÙÂû[32m(vine)£¬Äã×¢Òâµ½ÆÙ²¼ááÃæËÆºõ\n"
                        "ÓÐÊ²÷á¶«Î÷ÔÚ·¢Öø¹â¡£\n",
                "vine":
                        "ÆäÖÐÓÐÒ»¸ùÌÙÂû¾àÀëÄã±È½Ï½ü£¬Äã¿ÉÒÔÊÔÖø×¥×¡(hold)ÌÙÂû£¬¿´¿´\n"
                        "ÄÜ²»ÄÜµ´¹ýÈ¥£¬Ò²Ðí¿ÉÒÔÖªµÀÆÙ²¼ááÃæÓÐÊ²÷á£¿\n"
                        "¶ÔÁË£¬ÌáÐÑÄãÒ»µã£¬Õâ×ùÊ¯ÇÅÏÂÃæÊÇ¸ßÔ¼°ÙÕÉµÄÉ½½§Éî¹È....¡£\n"
        ]) );
        set("exits", ([ /* sizeof() == 2 */
	  "west" : __DIR__"epath1",
	  "east" : __DIR__"epath3",
	]));
        set("outdoors", "oldpine");

	set("coor/x",0);
	set("coor/y",30);
	set("coor/z",30);
	setup();
}

void init()
{
        add_action("do_hold_vine", ({ "hold", "grab" }) );
}

int do_hold_vine(string arg)
{
        if( !arg || arg!= "vine" )
                return notify_fail("ÄãÒª×¥×¡Ê²÷á£¿\n");
        message_vision("$NÅÀÉÏÊ¯ÇÅµÄ»¤À¸£¬ÉìÊÖÍù²»Ô¶´¦µÄÒ»¸ùÌÙÂû×¥È¥....\n",
                this_player());
        if( random((int)this_player()->query_skill("dodge")) < 5 ) {
                message_vision("\nÖ»Ìý¼ûÒ»ÉùÉ±Öí°ãµÄ²Ò½Ð£¬$NÒÑ¾­ÍùÉ½½§ÖÐ×¹ÁËÏÂÈ¥¡£\n\n", this_player());
                tell_room(__DIR__"waterfall",
                        "ÄãÌýµ½ÓÐÈË¸ßÉù¾ª½Ð£¬Ò»ÌõÈËÓ°´ÓÉÏ·½µôÁËÏÂÀ´£¬¡¸ÆËÍ¨¡¹Ò»Éùµø½øÌ¶ÖÐ¡£\n");
                this_player()->move(__DIR__"waterfall");
        } else {
                message_vision("$NÊÖ½ÅÀþÂäµØÅÊ¸½ÖøÌÙÂû£¬ÂýÂýµØÅÀÏÂÉ½½§....¡£\n",
                        this_player() );
                tell_room(__DIR__"passage",
                        "ºöÈ»Ò»ÌõÈËÓ°´ÓÄÏ±ßµÄÁ±Ä»´©ÁË³öÀ´¡£\n");
                this_player()->move(__DIR__"passage");
        }
        return 1;
}
