inherit ROOM;
#include <ansi.h>

void create()

{
        set("short", "Ã·»¨âÖÍâ");
        set("long", @LONG
²İÉ«¿İ»Æ£¬Ï¦ÑôÆàÆà²Ò²ÒÕÕÔÚÓÍÆá¾ÃÒÑ°şÂäµÄ´óÃÅÉÏ¡£ÒÀÏ¡»¹¿ÉÒÔ·Ö±æ³ö¡°[35mÃ·
»¨âÖ[32m¡±Èı¸ö×Ö¡£µ«ÊÇâÖÄÚâÖÍâµÄÃ·»¨ÄØ£¿ÄÑµÀÄÇĞ©¾óÇ¿µÄÃ·Ê÷£¬ÔÚ¾­ÀúÒ»³¡²Ò¾øÈË
å¾µÄÑªÕ½ºó£¬ÖÕÓÚ·¢ÏÖÁËÈËÀàµÄ²Ğ¿á£¬Ò²ÒÑ¾õµÃÈË¼äÎŞ¿ÉÁôÁµ£¬ÄşÔ¸¿³È¥µ±²ñÉÕ£¬
ÄşÔ¸ÔÚ»ğÑæÖĞ»¯Îª»Ò½ı£¿ÎŞÂÛÈçºÎ£¬ÕâÃûâÖÓÌÔÚ£¬µ«µ±ÄêµÄÓ¢ĞÛÃÇ£¬È´ÒÑºÍÃ·»¨Ò»
Æğ£¬È«²¿»¯×÷ÁË³¾ÍÁ¡£
LONG
        );
        set("exits", ([ 
		"eastdown" : __DIR__"road2b",
		"enter": __DIR__"meihuaan2",
	]));
        set("objects", ([
		__DIR__"npc/m_nun" : 1,
	]) );
	set("coor/x",0);
        set("coor/y",20);
        set("coor/z",80);
	set("map","eren");
	setup();
	replace_program(ROOM);
}
